app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @songs = Song.all
    if params[:artist_id]
      @artist = Artist.where("id =?", params[:artist_id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    if params[:artist_id]
      @song = Song.where("id =?", params[:id])
      @artist = Artist.where("id =?", params[:artist_id])